export default [
    {
        desc: '为了更好地向您提供会员服务，请您仔细阅读《咪咕视频会员服务协议》（以下简称“本协议”）。在您开始使用咪咕视频会员服务之前，请您务必认真阅读、充分理解本协议各条款内容。'
    },
    {
        desc: '第一条 服务条款的接受与修改',
        child: [
            {
                desc: '1. 本协议是咪咕视频会员与咪咕视讯科技有限公司（下称“咪咕视讯”）之间关于用户成为咪咕视频会员且使用咪咕视讯提供的会员服务所订立的协议。本协议描述咪咕视讯与会员之间关于软件许可以及服务使用及相关方面的权利义务。本服务协议构成您（无论个人或者单位）使用咪咕视讯所提供的会员服务之先决条件，除非您接受本协议条款，否则您无权使用本协议的相关服务。您的使用行为将视为同意接受本协议各项条款的约束。'
            }, {
                desc: '2. 咪咕视讯有权随时对服务条款进行修改，一旦服务条款发生变更和修改，咪咕视讯将在相关页面上提示修改的内容；如果会员不同意本协议的修改，可以取消已经获取的服务并停止使用；如果会员继续使用咪咕视讯提供的服务，则视为会员已经接受本协议的全部修改。'
            }, {
                desc: '3. 请您审阅并接受或不接受本协议，未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可，您在享受咪咕视讯会员服务时必须完全、严格遵守本服务协议条款。'
            }
        ]
    },
    {
        desc: '第二条 服务说明',
        child: [
            {
                desc: '1.咪咕视频会员分为月度会员、季度会员、半年会员及年费会员（以下统称“会员”），会员享有的具体权益内容以咪咕视频“会员中心”页面中关于会员特权具体描述为准。'
            },
            {
                desc: '2.会员使用咪咕视讯提供的任何服务时，会员的使用行为视为其对任何服务的服务条款以及咪咕视讯在服务中发出各类公告的同意。'
            },
            {
                desc: '3.咪咕视讯所提供的服务将按照本协议约定以及连续包月服务规则严格执行。'
            },
            {
                desc: '4.咪咕视频会员服务涉及的咪咕视讯产品所有权以及相关软件知识产权归咪咕视讯所有。'
            },
            {
                desc: '5.咪咕视讯享有对会员网上一切活动的监督、提示、检查的权利，如会员的行为违反有关法律法规或国家或行业监管部门的规定或违反本协议条款的约定，咪咕视讯享有要求其纠正及追究其责任等权利。'
            },
            {
                desc: '6.咪咕视讯向会员提供的全部服务，均仅限于会员在咪咕视讯平台使用，任何以恶意破解等非法手段将咪咕视讯提供的服务内容与咪咕视讯平台分离的行为，均不属于本协议中约定的咪咕视讯提供的服务。'
            },
            {
                desc: '7.您应自行负责妥善且正确地保管、使用、维护您在咪咕视讯申请取得的会员账户、账户信息及账户密码。您应对您的会员账户信息和账户密码采取必要和有效的保密措施。非咪咕视讯原因致使您的账户密码泄漏以及因您保管、使用、维护不当造成损失的，咪咕视讯无须承担与此有关的任何责任。'
            },
            {
                desc: '8.咪咕视讯不对您因第三方的行为或不作为造成的损失承担任何责任，包括但不限于支付服务和网络接入服务以及任意第三方的任何侵权行为。'
            }
        ]
    },
    {
        desc: '第三条 成为会员的程序',
        child: [
            {
                desc: '1. 在成为会员之前，您必须先根据真实、准确信息注册成为咪咕视讯用户。用户所填写的内容与个人资料必须真实有效，否则咪咕视讯有权拒绝其申请或撤销会员资格，并不予任何赔偿或退还会员服务费。会员的个人资料发生变化，应及时修改注册的个人资料，否则由此造成的会员权利不能全面有效行使的责任由会员自己承担。'
            },
            {
                desc: '2. 用户可通过各种已有和未来新增的渠道成为咪咕视频会员，包括但不限于：通过用户手机话费账户或第三方支付等方式成为会员。'
            },
            {
                desc: '3. 本服务是咪咕视讯提供的收费服务，您须在按照本服务的收费标准支付相应费用后，方可使用本服务。咪咕视讯可能会根据本服务的整体规划，对本服务相关权益细则、收费标准、方式等进行修改和变更，前述修改、变更，咪咕视讯将在咪咕视频“会员中心”服务页面进行展示。您在此理解并同意因会员套餐不同，咪咕视频会员将享受不同的增值服务或资费。'
            },
            {
                desc: '4. 成为会员后，会员有权利享有咪咕视讯提供的所有会员服务，同时，用户可申请取消会员服务，但已支付的会员服务费不予退还。'
            },
            {
                desc: '5. 会员账号所有权归咪咕视讯所有，会员拥有咪咕视讯账号的有限使用权。'
            }
        ]
    },
    {
        desc: '第四条 会员服务和账号查询',
        child: [
            {
                desc: '1. 一旦您成为会员，即视为您认可该项服务标明之价格；成为会员后，该项服务即时生效。'
            },
            {
                desc: '2. 您可以通过登录会员中心免费查询您的账号信息详情，包括已开通的服务内容、服务期限、消费金额等。'
            },
            {
                desc: '3. 咪咕视频会员在登陆后，可享受一键关闭片头广告的权益。视频暂停页面及咪咕视频产品各页固定广告位等情况下，仍存在在会员服务中提供静态广告画面的可能，您在此理解并同意豁免咪咕视讯的任何相关责任。'
            }
        ]
    },
    {
        desc: '第五条 会员时限及服务期限',
        child: [
            {
                desc: '1. 在线观看时限：您的观看服务周期不会因其在观看期间对节目的中断、终止、倒回等情况而延长。'
            },
            {
                desc: '2. 会员服务提供的视频都有固定的观看服务期限，您一旦成为会员即视为认可它的观看服务期限。'
            }
        ]
    },
    {
        desc: '第六条 会员的权利限制',
        child: [
            {
                desc: '1.会员服务仅限于申请账号自行使用；会员服务期内不能在帐号之间转移，禁止赠与、借用、租用、转让或售卖。'
            },
            {
                desc: '2.若会员的行为持续违反本协议或违反国家相关法律法规或国家或监管部门的规定，或咪咕视讯认为会员行为有损咪咕视讯或他人的声誉及利益，咪咕视讯公司有权取消该会员的资格而无须给与任何补偿。'
            },
            {
                desc: '3.会员不得以盗窃、利用系统漏洞等非法途径以及在未经咪咕视讯授权的非法销售会员的网站上获取或购买会员服务，否则咪咕视讯有权取消会员的服务资格。由此引发的问题由会员自行承担，咪咕视讯不负任何责任。'
            },
            {
                desc: '4.任何会员不得使用或发表带有非法、淫秽、污辱或人身攻击的含义污辱或人身攻击的昵称、评论或弹幕等，一经发现，咪咕视讯有权取消其会员资格而无需给与任何补偿和退费。'
            },
            {
                desc: '5.会员不得利用咪咕会员账号进行如下行为：',
                child: [
                    {
                        desc: '（1）提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；'
                    },
                    {
                        desc: '（2）强制、诱导其他用户关注、点击链接页面或分享信息的；'
                    },
                    {
                        desc: '（3）虚构事实、隐瞒真相以误导、欺骗他人的；'
                    },
                    {
                        desc: '（4）利用技术手段批量建立虚假账号的；'
                    },
                    {
                        desc: '（5）利用咪咕账号或服务从事任何违法犯罪活动或法律禁止行为的；'
                    },
                    {
                        desc: '（6）制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；'
                    },
                    {
                        desc: '（7）其他违反法律法规规定、侵犯其他用户合法权益、干扰咪咕产品正常运营或咪咕视讯未明示授权的行为。'
                    }
                ]
            },
            {
                desc: '6. 会员承诺：会员上传作品不得含有以下内容：',
                child: [
                    {
                        desc: '（1）反对宪法确定的基本原则的；'
                    },
                    {
                        desc: '（2）危害国家统一、主权和领土完整的；'
                    },
                    {
                        desc: '（3）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；'
                    },
                    {
                        desc: '（4）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；'
                    },
                    {
                        desc: '（5）宣扬恐怖主义、极端主义、邪教或封建迷信的；'
                    },
                    {
                        desc: '（6）编造、传播虚假信息，扰乱经济秩序和社会秩序，破坏社会稳定的；'
                    },
                    {
                        desc: '（7）教唆犯罪或者散布暴力、凶杀、淫秽、色情、赌博、恐怖活动的；'
                    },
                    {
                        desc: '（8）侮辱或者诽谤他人，侵害他人名誉、隐私、知识产权等其他合法权益的；'
                    },
                    {
                        desc: '（9）危害社会公德，损害民族优秀文化传统的；'
                    },
                    {
                        desc: '（10）有违背公序良俗的着装、发型、语言、动作，以低俗或不宜面向公众公开讨论的内容制造话题的；'
                    },
                    {
                        desc: '（11）有关法律法规和国家或行业监管部门规定禁止的其他内容。'
                    },
                    {
                        desc: '会员上传作品中含有上述内容的，咪咕视讯有权依据自己的独立判断采取直接删除、下架或屏蔽相应作品，禁用上传会员账号部分功能，注销账号等方式处理，并向有关部门报告。此外，会员应承担其违反行为导致的全部责任并赔偿因此给咪咕视讯造成的一切损失（包括但不限于赔偿金、罚款、罚金、律师费、诉讼费、执行费、公告费等）。'
                    }
                ]
            }
        ]
    },
    {
        desc: '第七条 协议的变更',
        child: [
            {
                desc: '1. 咪咕视讯依据本协议的约定变更服务内容、服务方式以及本用户协议内容的，如果会员不同意咪咕视讯的变更，有权选择取消并停止使用已经获取的对应的全部或部分服务；如果会员继续使用咪咕视讯提供的上述服务，则视为会员已经接受咪咕视讯的上述调整。'
            },
            {
                desc: '2. 会员服务提供的视频使用期限中包含咪咕视讯解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间咪咕视讯不予补偿并保留解释权。'
            },
            {
                desc: '3.会员在使用咪咕视讯所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，不论原因如何，咪咕视讯均不负责任。由于会员将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，咪咕视讯不负任何责任。'
            },
            {
                desc: '4. 会员如果不同意条款的修改，可主动向咪咕视讯提出终止会员服务，但咪咕视讯不退还自开通会员服务至提出终止会员服务所在月的已享受会员服务对应的费用；如果会员继续享用会员服务，则视为会员已经接受条款的修改。'
            }
        ]
    },
    {
        desc: '第八条 服务的中断和终止',
        child: [
            {
                desc: '1. 如会员违反或被视为违反本服务条款中的内容，咪咕视讯有权在不通知会员的情况下立即终止您已购买的所有服务，以及取消您的会员账户和使用权限，但不退还任何已缴纳的会员服务费用。'
            }
        ]
    },
    {
        desc: '第九条 知识产权归属',
        child: [
            {
                desc: '1. 除非另有约定或咪咕视讯另行声明，咪咕产品内的所有内容（用户和咪咕视讯合作伙伴依法享有权利的内容除外）、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于著作权、商标权、专利权、商业秘密等）及相关权利，均归咪咕视讯所有。未经咪咕视讯许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载、修改、出租），且不得对咪咕产品提供的服务所涉及的技术和软件进行任何反向工程、反向编译、反汇编或其他类似行为。'
            },
            {
                desc: '2. 会员可在咪咕产品指定版块上传作品等内容，其形式包括但不限于文字、图片、音频、视频等（以下简称“用户上传作品”）。会员上传作品的著作权及其他合法权益由用户或相关权利人享有。'
            },
            {
                desc: '3. 会员承诺：对会员上传作品拥有完整的著作权或已获得了著作权人的相应授权，其上传行为不侵犯他人著作权或其他权益。否则，咪咕视讯将主动或根据用户或第三方投诉删除、下架或屏蔽相应的会员上传作品，无须通知上传会员。会员应承担其侵权行为导致的全部责任并赔偿因此给咪咕视讯造成的一切损失（包括但不限于赔偿金、罚款、罚金、律师费、诉讼费、执行费、公告费等）'
            }
        ]
    },
    {
        desc: '第十条 违约责任',
        child: [
            {
                desc: '1.您在使用本服务的过程中，不得进行以下违约行为：',
                child: [
                    {
                        desc: '（1）违反本协议约定的；'
                    },
                    {
                        desc: '（2）违反法律法规或国家或行业监管部门的规定的；'
                    },
                    {
                        desc: '（3）进行危害计算机网络安全的行为；'
                    },
                    {
                        desc: '（4）侵犯任何第三方合法权益的；'
                    },
                    {
                        desc: '（5）利用本服务获取非法利益的；'
                    },
                    {
                        desc: '（6）其他侵犯咪咕视讯合法利益的行为。'
                    }
                ]
            },
            {
                desc: '2. 如会员的违约行为使咪咕视讯及其关联公司遭受任何损失的，会员应承担其行为导致的全部责任并赔偿因此给咪咕视讯及其关联公司造成的一切损失（包括但不限于赔偿金、罚款、罚金、律师费、诉讼费、执行费、公告费等）。'
            }
        ]
    },
    {
        desc: '第十一条 法律的适用和管辖',
        child: [
            {
                desc: '1. 本服务条款的生效、履行、解释及争议的解决均适用中华人民共和国法律（不包括中国香港、澳门及台湾地区法律）。'
            },
            {
                desc: '2. 如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，则争议各方一致同意将发生的争议提交协商不成时，任何一方均可向咪咕视讯住所地有管辖权的人民法院提起诉讼。'
            }
        ]
    }
];