export default [
    {
        desc: '1. 服务条款的接受与修改',
        child: [
            {
                desc: '本协议是咪咕视频会员（以下简称“会员”）与咪咕视讯科技有限公司及其关联公司（以下简称“咪咕视频”）之间关于会员使用咪咕视频提供的自动续费委托扣款服务（以下简称“本服务”）所订立的协议，本协议约定咪咕视频与会员之间关于本服务的使用及相关方面的权利义务。“会员”是指享受咪咕视频提供的会员服务的个人或单一实体。本协议构成会员（无论个人或者单位）使用咪咕视频所提供的本服务之先决条件，除非会员接受本协议全部条款，否则会员无权使用本服务，会员选择使用本服务行为将视为同意接受本协议各项条款的约束。'
            }
        ]
    },
    {
        desc: '2. 服务说明',
        child: [
            {
                desc: '2.1 本服务是出于会员对于自动续费的需求，在会员已开通本服务的前提下，避免会员因疏忽或其他原因导致未能及时续费造成损失而推出的服务，会员不可撤销地授权咪咕视频可在会员有效期即将过期内，从会员的自有充值账户、与会员账号绑定的第三方支付账户、银行卡、通信账户（以下统称“账户”）余额中代扣下一个计费周期的费用，计费周期包括但不限于月度、季度、年度等（下同），会员可根据咪咕视频平台上显示的计费周期自行选择。该服务实现的前提是会员已将其咪咕视频会员账号与上述账户绑定，且可成功从其上述账户中扣款。'
            },
            {
                desc: '2.2 自动续费具体指，基于2.1的前提，咪咕视频通过上述账户收取会员下一计费周期费用的扣费方式，会员需保证咪咕视频可以从上述账户扣款成功，因上述账户中可扣款余额不足等原因导致的续费失败，将影响会员下一计费周期对会员服务的使用，会员应自行承担全部责任。会员有义务定期关注并确保其用于该支付的账户中有充足的余额用于满足本服务的应用。如因前述原因瑕疵（包括但不限于：余额不足、账户冻结、账户异常等）而致使无法满足本服务的应用，则咪咕视频有权在不再作另行通知的前提下，暂停会员通过本服务所接入的下一计费周期的咪咕视频会员服务。'
            },
            {
                desc: '2.3 会员在享受本服务时，应受《咪咕用户服务协议》以及《咪咕视频会员服务协议》的约束，当会员使用本服务时，会员的使用行为视为其对本服务的服务条款以及咪咕视频针对本服务发出的各类公示的同意。'
            },
            {
                desc: '2.4 咪咕视频向会员提供的本服务均仅限于会员在咪咕视频平台使用，任何以恶意破解等非法手段将咪咕视频提供的本服务与咪咕视频平台分离的行为，均不属于本协议中约定的本服务。由此引起的一切法律后果由行为人自行承担，咪咕视频将依法追究行为人的法律责任。'
            }
        ]
    },
    {
        desc: '3. 双方的权利和义务',
        child: [
            {
                desc: '3.1 咪咕视频负责向会员提供有关自动续费收费具体情况的查询方式，根据会员的需求开具发票。'
            },
            {
                desc: '3.2 咪咕视频通过会员上述账户扣除下一计费周期费用的，将在扣划当天将扣划款项记入会员支付记录，并同时相应延长会员有效期。'
            },
            {
                desc: '3.3 如在扣费过程出现差错，咪咕视频和会员应密切配合查明原因，各自承担己方过错造成的损失；若因双方各自存在不均等过错造成损失的，由双方按过错的程度承担相应责任；因双方共同过错造成损失但无法区分各自过错的，由双方均摊责任。'
            },
            {
                desc: '3.4 咪咕视频可根据其业务开展或技术升级等情况变更或修改本协议的有关服务内容、规则及条款，咪咕视频将通过在咪咕视频相关页面公示的方式告知用户相关变更或修改内容。如果会员不同意本协议的修改，可以取消已经获取的本服务并停止使用；如果会员继续使用咪咕视频提供的服务，则视为会员已经接受本协议的全部修改。'
            },
            {
                desc: '3.5 本服务由会员自主选择是否取消，若会员选择不取消，则视为会员同意咪咕视频按照一定规则进行不定期的扣款尝试，一旦扣款成功，咪咕视频将为会员开通下一个计费周期的会员服务。'
            },
            {
                desc: '3.6 若在自动续费时/之前，咪咕视频服务价格发生调整，应以现时有效的价格为准。若咪咕视频服务价格发生调整的，咪咕视频将在相关页面公示的方式告知用户。如果会员不同意调整后的价格的，可以取消已经获取的本服务并停止使用；如果会员继续使用咪咕视频提供的服务，则视为会员已经接受调整后的价格。'
            },
            {
                desc: '3.7 咪咕视频对会员开通本服务不收取任何费用，但咪咕视频有权根据业务需要或市场变化等原因决定是否对本服务本身进行收费或调整自动续费周期及费用，并在相关页面向会员进行公示。'
            },
            {
                desc: '3.8会员认可并同意：在未获得咪咕视频事先书面许可之前，会员不得就其所获得之本服务用于非咪咕视频的其它领域，也不得直接或间接地对本服务进行任何商业化（包括但不限于：转售、贩卖、等价置换等）的行为。一旦发现会员涉及上述之行为，咪咕视频有权收回会员对本服务的使用权而不对该会员作出任何的赔偿，并保留进一步追究该会员行为而导致咪咕视频损失之权利。'
            }
        ]
    },
    {
        desc: '4. 协议有效期限、终止',
        child: [
            {
                desc: '4.1 本协议自会员选择接受或使用本服务后生效，直至会员终止本服务/注销会员资格时终止。'
            },
            {
                desc: '4.2 会员有权随时在会员账号设置中选择终止本服务，终止本服务后，咪咕视频将停止向会员提供本服务。'
            },
            {
                desc: '4.3 会员在选择终止本服务前已经委托咪咕视频自动续费扣款的指令仍然有效，咪咕视频对基于该指令扣除的费用不予退还，由会员承担相关责任。'
            }
        ]
    },

    {
        desc: '5．知识产权',
        child: [
            {
                desc: '本服务涉及到的一切咪咕视频内的所有内容（会员和咪咕视频合作伙伴依法享有权利的内容除外）、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于著作权、商标权、专利权、商业秘密等）及相关权利，均归咪咕视频所有，受中华人民共和国法律及国际公约的依法保护，会员不因使用本服务而自动获得前述的任一或全部权利。'
            }
        ]
    },
    {
        desc: '6. 违约责任',
        child: [
            {
                desc: '一方违反本协议任一条款均被视为违约。如果一方违约，守约方有权通过双方约定的争议解决方式获得补偿。'
            }
        ]
    },
    {
        desc: '7. 争议解决和法律适用',
        child: [
            {
                desc: '咪咕视频与会员应通过友好协商解决本协议履行过程中产生的争议，经协商无法解决的，任何一方均有权将争议提交至上海市浦东新区人民法院诉讼解决。本协议的解释、效力和执行等有关问题均适用中华人民共和国法律。'
            }
        ]
    },
];